# src/texts/common.py

ASK_TERM = (
    "Отлично!\n"
    "Подберу для тебя безопасный и подходящий формат занятий 🙏\n"
    "Подскажи, какой у тебя срок беременности?"
)

ASK_EXPERIENCE = (
    "Здорово!\n"
    "Еще один уточняющий вопрос: ты раньше пробовала заниматься йогой?"
)

SAFE_TEXT = (
    "Спасибо за твои ответы.\n\n"
    "Все практики безопасны, даже если ты никогда не занималась йогой. "
    "Если нет медицинских противопоказаний — добро пожаловать на коврик 🧘‍♀️"
)
SAFE_TEXT_EXPERIENCED = (
    "Спасибо за твои ответы.\n\n"
    "Если у тебя нет медицинских противопоказаний и беременность протекает без серьезных осложнений — добро пожаловать на коврик 🧘‍♀️" 
)

CONTRA_TEXT = (
    "При противопоказаниях к активному образу жизни во время беременности, в йоге есть особенные бережные практики, которые могут подойти тебе. "
    "Оставь свои контакты, и я свяжусь с тобой, чтобы обсудить детали."
)

FORMAT_TEXT = (
    "Теперь выбери удобный формат занятий:"
)