# src/texts/course.py

from src.config import (
    ONLINE_GROUP_PRICE_BYN, ONLINE_GROUP_PRICE_EUR,
    SINGLE_CLASS_PRICE_BYN, SINGLE_CLASS_PRICE_EUR,
    SUBSCRIPTION_4_CLASSES_PRICE_BYN, SUBSCRIPTION_4_CLASSES_PRICE_EUR,
    SUBSCRIPTION_8_CLASSES_PRICE_BYN, SUBSCRIPTION_8_CLASSES_PRICE_EUR,
    INDIVIDUAL_CLASS_PRICE_BYN, INDIVIDUAL_CLASS_PRICE_EUR
)



INDIVIDUAL_DESC = (
    f"Индивидуальные занятия — это максимально персонализированный подход, где всё внимание будет уделено именно тебе и твоим запросам.\n\n"
    f"🧘🏻Подберем безопасные и мягкие практики, чтобы подготовить тело к родам без стресса и напряжения \n\n"
    f"😮‍💨 Освоим техники дыхания для комфортной беременности и обезболивания в родах\n\n"
    f"📿По желанию добавим медитацию, чтобы укрепить связь с малышом и успокоить ум\n\n"
    f"🧖‍♀️Благодаря практикам релаксации, научимся полноценно отдыхать для восстановления сил\n\n"
    f"Длительность занятия –  60 минут.\n\n"
    f"Стоимость:\n"
    f"Разовое занятие: {SINGLE_CLASS_PRICE_BYN} BYN / {SINGLE_CLASS_PRICE_EUR} €\n"
    f"\nАбонемент на 4 занятия: {SUBSCRIPTION_4_CLASSES_PRICE_BYN} BYN / {SUBSCRIPTION_4_CLASSES_PRICE_EUR} €\n"
    f"\nАбонемент на 8 занятий: {SUBSCRIPTION_8_CLASSES_PRICE_BYN} BYN / {SUBSCRIPTION_8_CLASSES_PRICE_EUR} €\n\n"
)   

CONTACT_REQUEST = (
    "Чтобы подобрать лучшее время и обсудить детали, давай перейдём к личному общению с Анной.\n\n"
    "*Напиши, пожалуйста, свой телеграмм или телефон для связи*, и Анна напишет тебе в ближайшее время, чтобы всё организовать."
)



INDIVIDUAL_CLASS_CONSULT_TEXT = (
    f"Отличный выбор! Консультация с подбором практики — это твой личный план действий для комфортной беременности и уверенной подготовки к родам.\n\n"
    f"Как это проходит:\n"
    f"Это разовая встреча онлайн, где мы с тобой совмещаем беседу и практику.\n\n"
    f" 1. Консультация: обсудим твоё самочувствие, цели и вопросы.\n"
    f" 2. Занятие: проведу для тебя персональную практику йоги, дыхания и релаксации, подобранную именно под твои запросы.\n"
    f" 3. Запись: запишу всё занятие и вышлю тебе видео. Оно останется у тебя навсегда, и ты сможешь повторять его когда угодно.\n\n"
    f"Длительность встречи — 90 минут.\n"
    f"Стоимость: {INDIVIDUAL_CLASS_PRICE_BYN} BYN / {INDIVIDUAL_CLASS_PRICE_EUR} €"
)

ONLINE_GROUP_CLASS_DESC = (
f"ЧТО ТЕБЯ ЖДЕТ НА ЙОГЕ?\n"
f"🧘🏻‍♀️ Безопасные упражнения для здоровой спины, улучшения кровообращения, подвижности таза и снятия напряжения\n\n"
f"В КАЖДОМ уроке\n"
f"🧘🏻Упражнения: Безопасные и мягкие практики, подходящие даже для новичков, чтобы подготовить тело к родам \n"
f"😮‍💨Пранаяма: Дыхание, которое сохранит спокойствие и естественно обезболит\n"
f"📿Медитация: Укрепит связь с малышом и подарит уверенность\n"
f"🧖‍♀️Релаксация: Глубокий отдых для восстановления сил\n\n"
f"ПОЧЕМУ ЭТО УДОБНО?\n"
f"🏡 Не нужно тратить время на дорогу и подвергать себя и малыша дополнительной опасности в сезон вирусов и простуд \n"
f"📲 Вы можете заниматься онлайн, а также проходить занятия в записи в удобное время \n"
f"⏱️ Тайм-коды в уроках: легко переключаться между практикой, дыханием и релаксацией\n\n"
f"Время онлайн занятий — удобное для большинства участниц. \n"
f"Если вы пропускаете занятие, то сможете выполнить его в записи в удобное время.\n\n"
f"Стоимость абонемента: \n"
f"4 занятия по 60 минут \n"
f"+ запись занятий  \n"
f"неограниченный доступ 4 недели \n"
f"{ONLINE_GROUP_PRICE_BYN} BYN / {ONLINE_GROUP_PRICE_EUR}€ 🔥\n"
)

ABOUT_PROGRAM = (       
    f"ЙОГА ДЛЯ ПОДГОТОВКИ К РОДАМ  — это не просто сборник упражнений. Это пространство заботы о себе, где ты получишь знания и навыки  для легких родов.\n\n"
    f"{ONLINE_GROUP_CLASS_DESC}"
)
 
